modm-ext/data.modm.io/docs/svd/header_stm32f769xx.svd
        <register>
          <name>DCKCFGR1</name>
          <description>RCC Dedicated Clocks configuration register1</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PLLI2SDIVQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_27</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_29</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_31</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>PLLI2S division factor for PLLI2SDIVQ output by 32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSAIDIVQ</name>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_1</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_3</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_5</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_6</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_7</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_9</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_10</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_11</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_12</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_13</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_14</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_15</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_17</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_18</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_19</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_20</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_21</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_22</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_23</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_24</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_25</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_26</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_27</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_28</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_29</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_30</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_31</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_32</name>
                  <description>PLLSAI division factor for PLLSAIDIVQ output by 32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLSAIDIVR</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV_2</name>
                  <description>PLLSAI division factor for PLLSAIDIVR output by 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_4</name>
                  <description>PLLSAI division factor for PLLSAIDIVR output by 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_8</name>
                  <description>PLLSAI division factor for PLLSAIDIVR output by 8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_16</name>
                  <description>PLLSAI division factor for PLLSAIDIVR output by 16</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAI1SEL</name>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SAI2SEL</name>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TIMPRE</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWICE</name>
                  <description>Timers clock to twice PCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_TIMES</name>
                  <description>Timers clock to four time PCLK</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFSDM1SEL</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK2</name>
                  <description>PCLK2 clock used as DFSDM1 clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>System clock used as DFSDM1 clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADFSDM1SEL</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAI1</name>
                  <description>SAI1 clock used as DFSDM1 Audio clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAI2</name>
                  <description>SAI2 clock used as DFSDM1 Audio clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
